tutorials/verification/flowAroundSphere/baseCase/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType laminar;

//~ simulationType RAS;
//~ 
//~ RAS
//~ {
    //~ RASModel            kOmegaSST;
//~ 
    //~ turbulence          on;
//~ 
    //~ printCoeffs         on;
//~ }

//~ simulationType  LES;
//~ 
//~ LES
//~ {
    //~ LESModel        dynamicKEqn;
//~ 
    //~ turbulence      on;
//~ 
    //~ printCoeffs     on;
//~ 
    //~ delta           cubeRootVol;
//~ 
    //~ dynamicKEqnCoeffs
    //~ {
        //~ filter simple;
    //~ }
//~ 
    //~ cubeRootVolCoeffs
    //~ {
        //~ deltaCoeff      1;
    //~ }
//~ 
    //~ PrandtlCoeffs
    //~ {
        //~ delta           cubeRootVol;
        //~ cubeRootVolCoeffs
        //~ {
            //~ deltaCoeff      1;
        //~ }
//~ 
        //~ smoothCoeffs
        //~ {
            //~ delta           cubeRootVol;
            //~ cubeRootVolCoeffs
            //~ {
                //~ deltaCoeff      1;
            //~ }
//~ 
            //~ maxDeltaRatio   1.1;
        //~ }
//~ 
        //~ Cdelta          0.158;
    //~ }
//~ 
    //~ vanDriestCoeffs
    //~ {
        //~ delta           cubeRootVol;
        //~ cubeRootVolCoeffs
        //~ {
            //~ deltaCoeff      1;
        //~ }
//~ 
        //~ smoothCoeffs
        //~ {
            //~ delta           cubeRootVol;
            //~ cubeRootVolCoeffs
            //~ {
                //~ deltaCoeff      1;
            //~ }
//~ 
            //~ maxDeltaRatio   1.1;
        //~ }
//~ 
        //~ Aplus           26;
        //~ Cdelta          0.158;
    //~ }
//~ 
    //~ smoothCoeffs
    //~ {
        //~ delta           cubeRootVol;
        //~ cubeRootVolCoeffs
        //~ {
            //~ deltaCoeff      1;
        //~ }
//~ 
        //~ maxDeltaRatio   1.1;
    //~ }
//~ }

// ************************************************************************* //
