tutorials/verification/flowAroundSphere/baseCase/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name reactingCells;
        type cellSet;
        action new;
        source boxToCell;
        sourceInfo
        {
            box (-100 -100 -100) (100 100 100);
        }
    }
    {
        name    reactingCellZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set reactingCells;
        }
    } 
);

// ************************************************************************* //
